rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "new"], ["created_at", "2022-10-26 20:33:00.065903"], ["updated_at", "2022-10-26 20:33:00.065903"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def search_similar
    @movie = Movie.find(params[:id])
    if @movie.director.nil? or @movie.director.blank?