trapplar/app/controllers/traveling_plans_controller.rb

SELECT "attractions".* FROM "attractions"
---
  def search
    # our first page, where users can enter state, cities, number of traveling days.

    # @states = Attraction.all.map(&:state).uniq
    @states = ["NY", "CA"]
    @cities_in_state_hash = Attraction.all.group_by(&:state).map { |state, attractions| [state, attractions.map(&:city).uniq] }.to_h